# Universit√† degli studi di Milano-Bicocca
# Laurea Magistrale in Data Science
# Foundations of Computer Science (2021-2-F9101Q001)
## Camilla Di Bartolomeo, Vito Francone, Francesco Fustini

[University dataset](https://drive.google.com/drive/folders/1Hs3nRtK_F3h8eg59B4-TD1DEua6g8Klv)

Importazione delle librerie.

In [205]:
import pandas as pd
import re
import numpy as np

Importazione del dataset "timesData.csv", specificando che la virgola viene utilizzata come separatore per le migliaia, in modo che i dati contenuti nella colonna "num_students" vengano letti correttamente.

In [206]:
times = pd.read_csv('https://raw.githubusercontent.com/Vitorg-ux/Project2020/main/timesData.csv', thousands = ',', na_values = '-')
times.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
0,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,96.1,20152.0,8.9,25%,NaN,2011
1,2,California Institute of Technology,United States of America,97.7,54.6,98.0,99.9,83.7,96.0,2243.0,6.9,27%,33 : 67,2011
2,3,Massachusetts Institute of Technology,United States of America,97.8,82.3,91.4,99.9,87.5,95.6,11074.0,9.0,33%,37 : 63,2011
3,4,Stanford University,United States of America,98.3,29.5,98.1,99.2,64.3,94.3,15596.0,7.8,22%,42 : 58,2011
4,5,Princeton University,United States of America,90.9,70.3,95.4,99.9,NaN,94.2,7929.0,8.4,27%,45 : 55,2011

Importazione del dataset "ShanghaiData.csv".

In [207]:
shanghai = pd.read_csv('https://raw.githubusercontent.com/Vitorg-ux/Project2020/main/shanghaiData.csv')
shanghai.head()

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year
0,1,Harvard University,1,100.0,100.0,100.0,100.0,100.0,100.0,72.4,2005
1,2,University of Cambridge,1,73.6,99.8,93.4,53.3,56.6,70.9,66.9,2005
2,3,Stanford University,2,73.4,41.1,72.2,88.5,70.9,72.3,65.0,2005
3,4,"University of California, Berkeley",3,72.8,71.8,76.0,69.4,73.9,72.2,52.7,2005
4,5,Massachusetts Institute of Technology (MIT),4,70.1,74.0,80.6,66.7,65.8,64.3,53.0,2005

Importazione del dataset "cwurData.csv".

In [208]:
cwur = pd.read_csv('https://raw.githubusercontent.com/Vitorg-ux/Project2020/main/cwurData.csv')
cwur.head()

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
0,1,Harvard University,USA,1,7,9,1,1,1,1,NaN,5,100.00,2012
1,2,Massachusetts Institute of Technology,USA,2,9,17,3,12,4,4,NaN,1,91.67,2012
2,3,Stanford University,USA,3,17,11,5,4,2,2,NaN,15,89.50,2012
3,4,University of Cambridge,United Kingdom,1,10,24,4,16,16,11,NaN,50,86.17,2012
4,5,California Institute of Technology,USA,4,2,29,7,37,22,22,NaN,18,85.21,2012

## 1. For each university, extract from the times dataset the most recent and the least recent data, obtaining two separate dataframes

Creazione del dataframe "times_most_recent", contenente i dati pi√π recenti relativi a ciascuna universit√† presente nel dataframe "times".

In [209]:
times_most_recent = times.loc[times.groupby('university_name')['year'].idxmax()]
times_most_recent.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,NaN,NaN,35569.0,17.0,1%,NaN,2016
2003,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,NaN,17422.0,15.9,15%,48 : 52,2016
2056,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,NaN,16099.0,24.2,17%,32 : 68,2016
1908,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,23895.0,13.6,14%,54 : 46,2016
2105,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,NaN,9252.0,19.2,18%,48 : 52,2016

Creazione del dataframe "times_least_recent", contenente i dati meno recenti relativi a ciascuna universit√† presente nel dataframe "times".

In [210]:
times_least_recent = times.iloc[times.groupby('university_name')['year'].idxmin()]
times_least_recent.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,NaN,NaN,35569.0,17.0,1%,NaN,2016
501,301-350,Aalborg University,Denmark,19.0,75.3,20.0,27.1,36.4,NaN,17422.0,15.9,15%,48 : 52,2012
502,301-350,Aalto University,Finland,26.2,49.0,22.2,37.5,61.9,NaN,16099.0,24.2,17%,32 : 68,2012
166,167,Aarhus University,Denmark,38.1,33.4,55.6,57.3,61.5,49.9,23895.0,13.6,14%,54 : 46,2011
476,276-300,Aberystwyth University,United Kingdom,19.8,63.8,15.5,56.6,35.5,NaN,9252.0,19.2,18%,48 : 52,2012

## 2. For each university, compute the improvement in income between the least recent and the most recent data points

Creazione del dataframe "times_least_most_recent" effettuando un join dei dataframe "times_least_recent" e "times_most_recent".

In [211]:
times_least_most_recent = pd.merge(times_least_recent[['university_name', 'year', 'income']], times_most_recent[['university_name', 'year', 'income']], on = ['university_name'], suffixes = ('_least_recent', '_most_recent'))
times_least_most_recent.head()

,university_name,year_least_recent,income_least_recent,year_most_recent,income_most_recent
0,AGH University of Science and Technology,2016,NaN,2016,NaN
1,Aalborg University,2012,36.4,2016,43.7
2,Aalto University,2012,61.9,2016,61.6
3,Aarhus University,2011,61.5,2016,68.3
4,Aberystwyth University,2012,35.5,2016,31.3

Calcolo dell'incremento di reddito ("income_most_recent" - "income_least_recent") tra i dati pi√π recenti e quelli meno recenti per ciascuna universit√†.

In [212]:
times_least_most_recent['improvement'] = pd.to_numeric(times_least_most_recent['income_most_recent']) - pd.to_numeric(times_least_most_recent['income_least_recent'])
times_least_most_recent.head()

,university_name,year_least_recent,income_least_recent,year_most_recent,income_most_recent,improvement
0,AGH University of Science and Technology,2016,NaN,2016,NaN,NaN
1,Aalborg University,2012,36.4,2016,43.7,7.3
2,Aalto University,2012,61.9,2016,61.6,-0.3
3,Aarhus University,2011,61.5,2016,68.3,6.8
4,Aberystwyth University,2012,35.5,2016,31.3,-4.2

### 3. Find the university with the largest increase computed in the previous point

In [213]:
times_least_most_recent[times_least_most_recent['improvement'] >= times_least_most_recent['improvement'].max()]

,university_name,year_least_recent,income_least_recent,year_most_recent,income_most_recent,improvement
428,TU Dresden,2012,31.9,2016,99.7,67.8

## 4. For each ranking, consider only the most recent data point. For each university, compute the maximum difference between the rankings (e.g. for Aarhus University the value is 122-73=49). Notice that some rankings are expressed as a range

Creazione del dataframe "shanghai_most_recent", contenente i dati pi√π recenti relativi a ciascuna universit√† presente nel dataframe "shanghai".

In [214]:
shanghai_most_recent = shanghai.iloc[shanghai.groupby('university_name').idxmax()['year']]
shanghai_most_recent.head()

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year
4697,301-400,Aalborg University,5,NaN,0.0,0.0,11.2,4.6,30.4,16.8,2015
4797,401-500,Aalto University,4-6,NaN,0.0,0.0,0.0,10.4,33.4,17.0,2015
4469,73,Aarhus University,2,27.3,11.5,22.1,12.3,25.8,51.8,31.0,2015
4497,101-150,Aix Marseille University,5-6,NaN,13.6,0.0,15.2,20.3,50.1,27.6,2015
3115,102-150,Aix-Marseille University,4-6,NaN,15.6,0.0,16.1,22.4,44.3,15.3,2011

Ridenominazione della colonna "institution" del dataframe "cwur" in "university_name".

In [215]:
cwur.rename(columns = {'institution' : 'university_name'}, inplace = True)

Creazione del dataframe "cwur_most_recent", contenente i dati pi√π recenti relativi a ciascuna universit√† presente nel dataframe "cwur".

In [216]:
cwur_most_recent = cwur.iloc[cwur.groupby('university_name').idxmax()['year']]
cwur_most_recent.head()

,world_rank,university_name,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
1981,782,AGH University of Science and Technology,Poland,4,267,279,218,708,891,511,896.0,398,44.26,2015
1764,565,Aalborg University,Denmark,5,367,439,218,596,660,287,520.0,401,44.59,2015
1620,421,Aalto University,Finland,4,367,224,218,336,403,645,424.0,246,45.10,2015
1321,122,Aarhus University,Denmark,2,310,165,106,91,81,101,95.0,154,49.65,2015
2013,814,Aberystwyth University,United Kingdom,59,367,567,218,842,552,511,754.0,607,44.22,2015

Creazione del dataframe "most_recent_ranking", costruito effettuando il join dei dataframe "times_most_recent", "shanghai_most_recent" e "cwur_most_recent".

In [217]:
most_recent_ranking = pd.merge(times_most_recent[['university_name', 'world_rank']], shanghai_most_recent[['university_name', 'world_rank']], on = ['university_name'], suffixes = ('_intervals_times', '_intervals_shanghai'))
most_recent_ranking = pd.merge(most_recent_ranking, cwur_most_recent[['university_name', 'world_rank']], on = ['university_name'])
most_recent_ranking.rename(columns = {'world_rank' : 'world_rank_cwur'}, inplace = True)
most_recent_ranking.head()

,university_name,world_rank_intervals_times,world_rank_intervals_shanghai,world_rank_cwur
0,Aalborg University,201-250,301-400,565
1,Aalto University,251-300,401-500,421
2,Aarhus University,=106,73,122
3,Aix-Marseille University,251-300,102-150,206
4,Aristotle University of Thessaloniki,601-800,401-500,459

Estrazione del valore numerico del ranking dai dati dei dataframe "times_most_recent" e "shanghai_most_recent"

In [218]:
interval_times = most_recent_ranking['world_rank_intervals_times'].str.extract('(\d+)\-?(\d*)')
interval_times[0] = pd.to_numeric(interval_times[0])
interval_times[1] = pd.to_numeric(interval_times[1])
most_recent_ranking['world_rank_times'] = np.nanmean(interval_times, axis = 1).round()
most_recent_ranking.head()

,university_name,world_rank_intervals_times,world_rank_intervals_shanghai,world_rank_cwur,world_rank_times
0,Aalborg University,201-250,301-400,565,226.0
1,Aalto University,251-300,401-500,421,276.0
2,Aarhus University,=106,73,122,106.0
3,Aix-Marseille University,251-300,102-150,206,276.0
4,Aristotle University of Thessaloniki,601-800,401-500,459,700.0

In [219]:
interval_shanghai = most_recent_ranking['world_rank_intervals_shanghai'].str.extract('(\d+)\-?(\d*)')
interval_shanghai[0] = pd.to_numeric(interval_shanghai[0])
interval_shanghai[1] = pd.to_numeric(interval_shanghai[1])
most_recent_ranking['world_rank_shanghai'] = np.nanmean(interval_shanghai, axis = 1).round()
most_recent_ranking.head()

,university_name,world_rank_intervals_times,world_rank_intervals_shanghai,world_rank_cwur,world_rank_times,world_rank_shanghai
0,Aalborg University,201-250,301-400,565,226.0,350.0
1,Aalto University,251-300,401-500,421,276.0,450.0
2,Aarhus University,=106,73,122,106.0,73.0
3,Aix-Marseille University,251-300,102-150,206,276.0,126.0
4,Aristotle University of Thessaloniki,601-800,401-500,459,700.0,450.0

Calcolo della massima differenza fra i ranking

In [220]:
most_recent_ranking['max_difference'] = most_recent_ranking[['world_rank_times','world_rank_shanghai', 'world_rank_cwur']].astype(int).max(axis = 1) - most_recent_ranking[['world_rank_times','world_rank_shanghai', 'world_rank_cwur']].astype(int).min(axis = 1)
most_recent_ranking[['university_name', 'world_rank_times','world_rank_shanghai', 'world_rank_cwur', 'max_difference']]

,university_name,world_rank_times,world_rank_shanghai,world_rank_cwur,max_difference
0,Aalborg University,226.0,350.0,565,339
1,Aalto University,276.0,450.0,421,174
2,Aarhus University,106.0,73.0,122,49
3,Aix-Marseille University,276.0,126.0,206,150
4,Aristotle University of Thessaloniki,700.0,450.0,459,250
...,...,...,...,...,...
357,Yale University,12.0,11.0,11,1
358,Yeshiva University,164.0,250.0,171,86
359,Yonsei University,326.0,250.0,98,228
360,York University,326.0,450.0,337,124
361,Zhejiang University,276.0,126.0,191,150

### 5. Consider only the most recent data point of the times dataset. Compute the number of male and female students for each country

Creazione del dataframe "times_most_recent_f_m" a partire dalle colonne "university_name", "country", "num_students" e "female_male_ratio" del dataframe "times_most_recent".

In [221]:
times_most_recent_f_m = times_most_recent[['university_name', 'country', 'num_students', 'female_male_ratio']].dropna(subset = ['female_male_ratio', 'num_students']).copy()
times_most_recent_f_m.head()

,university_name,country,num_students,female_male_ratio
2003,Aalborg University,Denmark,17422.0,48 : 52
2056,Aalto University,Finland,16099.0,32 : 68
1908,Aarhus University,Denmark,23895.0,54 : 46
2105,Aberystwyth University,United Kingdom,9252.0,48 : 52
2404,Adam Mickiewicz University,Poland,40633.0,71 : 29

Controllo che la somma dei valori di female e male in "female_male_ratio" sia 100.

In [222]:
check = times_most_recent_f_m['female_male_ratio'].str.extract(r'(\d+) : (\d+)')
check['check'] = check[0].astype(int) + check[1].astype(int) - 100
check['check'].sum()

0

Calcolo del numero di studentesse in ogni universit√†.

In [223]:
times_most_recent_f_m['females'] = times_most_recent_f_m['female_male_ratio'].str.extract('^(\d+)')
times_most_recent_f_m['females'] = round(pd.to_numeric(times_most_recent_f_m['females']) * times_most_recent_f_m['num_students'] / 100)
times_most_recent_f_m.head()

,university_name,country,num_students,female_male_ratio,females
2003,Aalborg University,Denmark,17422.0,48 : 52,8363.0
2056,Aalto University,Finland,16099.0,32 : 68,5152.0
1908,Aarhus University,Denmark,23895.0,54 : 46,12903.0
2105,Aberystwyth University,United Kingdom,9252.0,48 : 52,4441.0
2404,Adam Mickiewicz University,Poland,40633.0,71 : 29,28849.0

Calcolo del numero di studenti in ogni universit√†.

In [224]:
times_most_recent_f_m['males'] = times_most_recent_f_m['female_male_ratio'].str.extract('(\d+)$')
times_most_recent_f_m['males'] = round(pd.to_numeric(times_most_recent_f_m['males']) * times_most_recent_f_m['num_students'] / 100)
times_most_recent_f_m.head()

,university_name,country,num_students,female_male_ratio,females,males
2003,Aalborg University,Denmark,17422.0,48 : 52,8363.0,9059.0
2056,Aalto University,Finland,16099.0,32 : 68,5152.0,10947.0
1908,Aarhus University,Denmark,23895.0,54 : 46,12903.0,10992.0
2105,Aberystwyth University,United Kingdom,9252.0,48 : 52,4441.0,4811.0
2404,Adam Mickiewicz University,Poland,40633.0,71 : 29,28849.0,11784.0

Calcolo del numero totale di studentesse e di quello di studenti per ciascun paese.

In [225]:
times_most_recent_f_m.groupby('country', as_index = False).sum()[['country', 'females', 'males']]

                     country    females      males
0                  Argentina    67191.0    41182.0
1                  Australia   391736.0   321640.0
2                    Austria    68364.0    66113.0
3                 Bangladesh    21323.0    41393.0
4                    Belarus    20219.0     9084.0
..                       ...        ...        ...
65                    Uganda    18670.0    18670.0
66                   Ukraine    17846.0    19250.0
67      United Arab Emirates     9516.0     4931.0
68            United Kingdom   711814.0   613028.0
69  United States of America  1601453.0  1556324.0

[70 rows x 3 columns]

## 6. Find the universities where the ratio between female and male is below the average ratio (computed over all universities)

Creazione della colonna "ratio", contenente il rapporto tra studentesse e studenti per ciascuna universit√†.

In [226]:
times_most_recent_f_m['ratio'] = times_most_recent_f_m['females'] / times_most_recent_f_m['males']
times_most_recent_f_m.head()

,university_name,country,num_students,female_male_ratio,females,males,ratio
2003,Aalborg University,Denmark,17422.0,48 : 52,8363.0,9059.0,0.923170
2056,Aalto University,Finland,16099.0,32 : 68,5152.0,10947.0,0.470631
1908,Aarhus University,Denmark,23895.0,54 : 46,12903.0,10992.0,1.173854
2105,Aberystwyth University,United Kingdom,9252.0,48 : 52,4441.0,4811.0,0.923093
2404,Adam Mickiewicz University,Poland,40633.0,71 : 29,28849.0,11784.0,2.448150

Calcolo del rapporto medio tra studentesse e studenti su tutte le universit√†.

In [227]:
avg_ratio = times_most_recent_f_m['females'].sum() / times_most_recent_f_m['males'].sum()
avg_ratio

1.070989873395366

Estrazione delle universit√† caratterizzate da un rapporto tra studentesse e studenti minore di quello medio.

In [228]:
below_avg_f_m_ratio = times_most_recent_f_m[times_most_recent_f_m['ratio'] < avg_ratio]
below_avg_f_m_ratio.head()

,university_name,country,num_students,female_male_ratio,females,males,ratio
2003,Aalborg University,Denmark,17422.0,48 : 52,8363.0,9059.0,0.923170
2056,Aalto University,Finland,16099.0,32 : 68,5152.0,10947.0,0.470631
2105,Aberystwyth University,United Kingdom,9252.0,48 : 52,4441.0,4811.0,0.923093
2406,Ajou University,South Korea,12706.0,33 : 67,4193.0,8513.0,0.492541
2408,Alexandria University,Egypt,127431.0,46 : 54,58618.0,68813.0,0.851845

### 7. For each country, compute the fraction of the students in the country that are in one of the universities computed in the previous point (that is, the denominator of the ratio is the total number of students over all universities in the country)

Creazione del dataframe "total_students_in_country", contenente il numero totale di studenti per ogni paese.

In [229]:
total_students_in_country = times_most_recent.groupby('country', as_index = False).sum()[['country', 'num_students']]
total_students_in_country.rename(columns = {'num_students' : 'total_students'}, inplace = True)
total_students_in_country.head()

      country  total_students
0   Argentina        108373.0
1   Australia        743627.0
2     Austria        134477.0
3  Bangladesh         62716.0
4     Belarus         29303.0

Creazione del dataframe "students_in_country_below_avg" che, per ciascun paese, contiene il numero di studenti che frequentano un'universit√† caratterizzata da un rapporto tra studentesse e studenti minore di quello medio.

In [230]:
students_in_country_below_avg = below_avg_f_m_ratio.groupby('country', as_index = False).sum()[['country', 'num_students']]
students_in_country_below_avg.head()

      country  num_students
0   Australia      146235.0
1     Austria       61033.0
2  Bangladesh       62716.0
3      Brazil      278774.0
4      Canada       86779.0

Creazione del dataframe "students_in_country", unione dei dataframe "students_in_country_below_avg" e "total_students_in_country".

In [231]:
students_in_country = pd.merge(students_in_country_below_avg, total_students_in_country, on = ['country'])
students_in_country.head()

      country  num_students  total_students
0   Australia      146235.0        743627.0
1     Austria       61033.0        134477.0
2  Bangladesh       62716.0         62716.0
3      Brazil      278774.0        534688.0
4      Canada       86779.0        717054.0

Calcolo del rapporto tra il numero di universitari che frequentano un'universit√† caratterizzata da un rapporto tra studentesse e studenti minore di quello medio e il numero di studenti totali per ciascun paese.

In [232]:
students_in_country['ratio'] = students_in_country['num_students'] / students_in_country['total_students']
students_in_country.head()

      country  num_students  total_students     ratio
0   Australia      146235.0        743627.0  0.196651
1     Austria       61033.0        134477.0  0.453855
2  Bangladesh       62716.0         62716.0  1.000000
3      Brazil      278774.0        534688.0  0.521377
4      Canada       86779.0        717054.0  0.121022

### 8. Read the file educational_attainment_supplementary_data.csv, discarding any row with missing country_name or series_name

In [233]:
attainment = pd.read_csv('https://raw.githubusercontent.com/Vitorg-ux/Project2020/main/educational_attainment_supplementary_data.csv')
attainment.dropna(subset = ['country_name', 'series_name'], inplace = True)
attainment.head()

,country_name,series_name,1985,1986,1987,1990,1991,1992,1993,1995,...,2005,2006,2007,2008,2009,2010,2011,2012,2013,2015
0,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.33,NaN,NaN,0.44,NaN,NaN,NaN,0.57,...,0.86,NaN,NaN,NaN,NaN,1.27,NaN,NaN,NaN,NaN
1,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1.03,NaN,NaN,1.26,NaN,NaN,NaN,1.54,...,2.18,NaN,NaN,NaN,NaN,2.64,NaN,NaN,NaN,NaN
2,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.83,NaN,NaN,0.95,NaN,NaN,NaN,1.26,...,1.01,NaN,NaN,NaN,NaN,2.45,NaN,NaN,NaN,NaN
3,Afghanistan,"Barro-Lee: Average years of primary schooling,...",2.34,NaN,NaN,2.22,NaN,NaN,NaN,2.37,...,2.26,NaN,NaN,NaN,NaN,3.55,NaN,NaN,NaN,NaN
4,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.54,NaN,NaN,0.92,NaN,NaN,NaN,0.94,...,2.00,NaN,NaN,NaN,NaN,1.29,NaN,NaN,NaN,NaN

In [234]:
attainment[attainment['country_name'].isnull()]

Empty DataFrame
Columns: [country_name, series_name, 1985, 1986, 1987, 1990, 1991, 1992, 1993, 1995, 1996, 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2015]
Index: []

[0 rows x 29 columns]

In [235]:
attainment[attainment['series_name'].isnull()]

Empty DataFrame
Columns: [country_name, series_name, 1985, 1986, 1987, 1990, 1991, 1992, 1993, 1995, 1996, 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2015]
Index: []

[0 rows x 29 columns]

### 9. From attainment build a dataframe with the same data, but with 4 columns: country_name, series_name, year, value

In [236]:
unpivoted_attainment = pd.melt(attainment, id_vars=['country_name', 'series_name'], var_name = 'year')
unpivoted_attainment

,country_name,series_name,year,value
0,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1985,0.33
1,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1985,1.03
2,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1985,0.83
3,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1985,2.34
4,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1985,0.54
...,...,...,...,...
2134345,Zimbabwe,UIS: Percentage of population age 25+ with som...,2015,NaN
2134346,Zimbabwe,UIS: Percentage of population age 25+ with som...,2015,NaN
2134347,Zimbabwe,UIS: Percentage of population age 25+ with unk...,2015,NaN
2134348,Zimbabwe,UIS: Percentage of population age 25+ with unk...,2015,NaN
2134349,Zimbabwe,UIS: Percentage of population age 25+ with unk...,2015,NaN

### 10. For each university, find the number of rankings in which they appear (it suffices to appear in one year for each ranking)

Creazione dell'elenco di universit√† contenute in ciascuno dei tre dataframe "times", "shanghai" e "cwur" e calcolo del numero di occorrenze.

In [237]:
universities_times = pd.Series(times['university_name'].unique())
universities_shanghai = pd.Series(shanghai['university_name'].unique())
universities_cwur = pd.Series(cwur['university_name'].unique())
number_of_rankinkgs = pd.concat([universities_times, universities_shanghai, universities_cwur]) 
number_of_rankinkgs.value_counts()

Hiroshima University                   3
University of Basel                    3
Queensland University of Technology    3
University of Cincinnati               3
Osaka Prefecture University            3
                                      ..
University of Goettingen               1
Sungkyunkwan University (SKKU)         1
St George's, University of London      1
Palack√Ω University in Olomouc          1
Zhejiang University of Technology      1
Length: 1452, dtype: int64

### 11. In the times ranking, compute the number of times each university appears

In [238]:
number_times = times.groupby('university_name').size()
number_times.head()

university_name
AGH University of Science and Technology    1
Aalborg University                          5
Aalto University                            5
Aarhus University                           6
Aberystwyth University                      5
dtype: int64

### 12. Find the universities that appear at most twice in the times ranking¬∂

In [239]:
number_times[number_times <= 2]

university_name
AGH University of Science and Technology    1
Adam Mickiewicz University                  1
Aix-Marseille University                    1
Ajou University                             1
Alexandru Ioan Cuza University              1
                                           ..
Yokohama City University                    1
Yokohama National University                1
Yuan Ze University                          2
Yƒ±ldƒ±z Technical University                 1
√ñrebro University                           1
Length: 408, dtype: int64

### 13. The universities that, in any year, have the same position in all three rankings (they must have the same position in a year)

Conversione dei valori dei ranking a partire dalla 100esima posizione in intervalli di ampiezza pari a 100 per uniformare i valori dei ranking nei tre dataframe.

In [240]:
times['world_rank_intervals'] = times['world_rank'].str.extract('(\d+)\-?\d*')
times['world_rank_intervals'] = pd.to_numeric(times['world_rank_intervals'] )
times.loc[times['world_rank_intervals']>99, 'world_rank_intervals'] = times['world_rank_intervals'] // 100 * 100
times['world_rank_intervals'].unique()

array([  1,   2,   3,   4,   5,   6,   8,   9,  10,  11,  12,  13,  14,
        15,  17,  18,  19,  20,  21,  22,  23,  24,  25,  26,  27,  28,
        29,  30,  32,  33,  34,  35,  36,  37,  38,  39,  40,  41,  42,
        43,  47,  48,  49,  51,  52,  53,  54,  55,  56,  57,  58,  59,
        60,  61,  63,  64,  65,  66,  67,  68,  71,  72,  73,  75,  76,
        77,  78,  79,  81,  83,  85,  86,  87,  88,  89,  90,  93,  94,
        95,  98,  99, 100,   7,  16,  31,  44,  45,  46,  62,  69,  70,
        74,  80,  84,  91,  92,  96,  97, 200, 300,  50,  82, 400, 500,
       600], dtype=int64)

In [241]:
shanghai['world_rank_intervals'] = shanghai['world_rank'].str.extract('(\d+)\-?\d*')
shanghai['world_rank_intervals'] = pd.to_numeric(shanghai['world_rank_intervals'] )
shanghai.loc[shanghai['world_rank_intervals']>99, 'world_rank_intervals'] = shanghai['world_rank_intervals'] // 100 * 100
shanghai['world_rank_intervals'].unique()

array([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
        14,  15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,  26,
        27,  28,  29,  30,  31,  32,  34,  35,  36,  37,  38,  39,  41,
        43,  45,  46,  47,  50,  51,  52,  53,  54,  55,  56,  57,  60,
        61,  62,  63,  64,  65,  67,  69,  71,  72,  73,  75,  76,  77,
        78,  80,  82,  83,  84,  85,  86,  87,  89,  90,  92,  93,  97,
        98,  99, 100, 200, 300, 400,  33,  40,  42,  44,  48,  58,  59,
        66,  68,  70,  74,  79,  81,  88,  94,  95,  96,  49,  91],
      dtype=int64)

In [242]:
cwur['world_rank_intervals'] = cwur['world_rank']
cwur.loc[pd.to_numeric(cwur['world_rank_intervals'])>99, 'world_rank_intervals'] = pd.to_numeric(cwur['world_rank_intervals']) // 100 * 100
cwur['world_rank_intervals'].unique()

array([   1,    2,    3,    4,    5,    6,    7,    8,    9,   10,   11,
         12,   13,   14,   15,   16,   17,   18,   19,   20,   21,   22,
         23,   24,   25,   26,   27,   28,   29,   30,   31,   32,   33,
         34,   35,   36,   37,   38,   39,   40,   41,   42,   43,   44,
         45,   46,   47,   48,   49,   50,   51,   52,   53,   54,   55,
         56,   57,   58,   59,   60,   61,   62,   63,   64,   65,   66,
         67,   68,   69,   70,   71,   72,   73,   74,   75,   76,   77,
         78,   79,   80,   81,   82,   83,   84,   85,   86,   87,   88,
         89,   90,   91,   92,   93,   94,   95,   96,   97,   98,   99,
        100,  200,  300,  400,  500,  600,  700,  800,  900, 1000],
      dtype=int64)

Creazione di un dataframe per il confronto contenente tutti e tre i ranking.

In [243]:
position = pd.merge(times[['university_name','year','world_rank_intervals']],shanghai[['university_name','year','world_rank_intervals']], on = ['university_name','year'], suffixes = ('_times','_shanghai'))
position = pd.merge(position,cwur[['university_name','year','world_rank_intervals']], on = ['university_name','year'])
position.rename(columns = {'world_rank_intervals' : 'world_rank_intervals_cwur'}, inplace = True)
position

,university_name,year,world_rank_intervals_times,world_rank_intervals_shanghai,world_rank_intervals_cwur
0,California Institute of Technology,2012,1,6,5
1,Harvard University,2012,2,1,1
2,Stanford University,2012,2,2,3
3,University of Oxford,2012,4,10,7
4,Princeton University,2012,5,7,6
...,...,...,...,...,...
546,University of Graz,2015,300,400,500
547,University of Lisbon,2015,300,200,200
548,University of Turku,2015,300,300,300
549,University of Vermont,2015,300,300,300
550,Wuhan University,2015,300,300,400

Estrazione delle universit√† che nello stesso anno occupano la stessa posizione nei tre ranking.

In [244]:
confronto[(confronto['world_rank_intervals_times'] == confronto['world_rank_intervals_cwur']) & (confronto['world_rank_intervals_shanghai'] == confronto['world_rank_intervals_cwur'])].head()

,university_name,year,world_rank_intervals_times,world_rank_intervals_shanghai,world_rank_intervals_cwur
60,Stanford University,2013,2,2,2
168,University of Montreal,2014,100,100,100
170,University of Alberta,2014,100,100,100
173,Technical University of Denmark,2014,100,100,100
175,University of Sussex,2014,100,100,100